[
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.15.3",
    "Date": "2025-04-18",
    "ChangeGroups": [
      {
        "Name": "Hotfix",
        "Changes": [
          "Fixed mod not loading."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.15.2",
    "Date": "2025-04-18",
    "ChangeGroups": [
      {
        "Name": "Changes",
        "Changes": [
          "Moved the compatibility groups to the right side of the screen.",
          "Small UI improvements related to the compatibility report, including an updated visual of the last review date and how many active reports a mod has.",
          "Added a new caution stability; 'Multiple Active Reports' when a mod has 5 or more reports.",
          "Fixed the sorting order button being missing from the compatibility report.",
          "Fixed some filter options not working properly in the compatibility report."
        ]
      },
      {
        "Name": "Other Changes",
        "Changes": [
          "Added the mod's thumbnail to the gallery tab.",
          "Fixed images not loading properly."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.15.1",
    "Date": "2025-04-12",
    "ChangeGroups": [
      {
        "Name": "Hotfix",
        "Changes": [
          "Fixed DLCs not loading properly."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.15.0",
    "Date": "2025-04-11",
    "Tagline": "DLCs and CCPs",
    "ChangeGroups": [
      {
        "Name": "Re-introducing the DLCs and CCPs tab",
        "Changes": [
          "Easily see what DLCs you have and all available DLCs at a glance in the dedicated tab.",
          "Matching DLC requirements on PDX Mods to the DLCs that you have for better a compatibility report.",
          "DLCs are currently expected to only work for steam users, if you're using the game on the Microsoft store and wish to help get this feature implemented for you and other Microsoft users, let me know on the discord server!"
        ]
      },
      {
        "Name": "Filter Changes",
        "Changes": [
          "Author dropdown now shows all authors that you've ever seen on the app, rather than just authors of your subscribed mods.",
          "Author dropdown now uses the same color-coding as the rest of the app and also includes authors' avatars.",
          "Fixed the Tags dropdown not working in the PDX Mods tab.",
          "Fixed the Code/Asset toggle not taking assets like decals, asset packs, themes, etc. in consideration."
        ]
      },
      {
        "Name": "Other Changes",
        "Changes": [
          "Moved cached images location to the Skyve installation folder instead of the ModsData folder.",
          "Fixed applying actions in the compatibility report asking to subscribe to dependencies."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.14.0",
    "Date": "2025-03-18",
    "Tagline": "Troubleshoot Mode",
    "ChangeGroups": [
      {
        "Name": "Re-introducing Troubleshoot Mode",
        "Changes": [
          "Troubleshoot mode from the C:S1 days is back, giving you a conveniant way to troubleshoot what mod is causing issues.",
          "This mode will automatically group, enable and disable specific mods, in a series of stages, allowing you to find the mod causing issues at the end.",
          "Troubleshoot mode can be accessed from the Utilities, and Help tabs."
        ]
      },
      {
        "Name": "Other Changes",
        "Changes": [
          "Updated to the PDX SDK v1.31"
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.13.1",
    "Date": "2025-02-21",
    "ChangeGroups": [
      {
        "Name": "PDX Mods Tab Changes",
        "Changes": [
          "Changed the PDX Mods tab to a paged browsing experience instead of an infinite scroll.",
          "Added a 'Tags' panel on the right of the PDX Mods tab for easier tag filtering.",
          "Removed the 'Recently Updated' effect in the PDX Mods tab.",
          "Improved the 'Search the workshop instead' prompts when no results match your filters in the local content. It now properly selects the tags and search both in-app and in the browser."
        ]
      },
      {
        "Name": "Other Changes",
        "Changes": [
          "Fixed not being able to download a large mod if you changed content locations and your main drive was full.",
          "Increased the severity of disabled mods with a 'Broken from Patch/Version' compatibility state to 'Warning'. This will mark the mod even when it's not in your playset.",
          "Added a tooltip on the version and update time labels in the mod page to show the version ID and raw update time respectively.",
          "Fixed the mod version using the version ID instead of the actual version number in some parts of the app.",
          "Temporarily disabled asset icons.",
          "Updated Translations."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.13.0",
    "Date": "2025-01-25",
    "ChangeGroups": [
      {
        "Name": "Framework Update",
        "Changes": [
          "Updated to the latest PDX Mods SDK.",
          "Updated the framework version from .NET 4.7.2 to .NET 4.8 to match the PDX Mods SDK's target framework.",
          "Added a 'Filesystem' file in the log report which represents a full list of the files in the user's CS2 appdata folder."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.12.8",
    "Date": "2025-01-14",
    "ChangeGroups": [
      {
        "Name": "Hotfix",
        "Changes": [
          "Fixed a crash when adding some mods to your playset."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.12.7",
    "Date": "2025-01-04",
    "ChangeGroups": [
      {
        "Name": "Minor Changes",
        "Changes": [
          "Changed the 'No Mods' launch option from --disableModding to --disableCodeModding",
          "Added settings (.coc) files to the log report.",
          "Renamed some files in the log report.",
          "Fixed the errors list in the log report only showing errors from Player.log",
          "Fixed mods list in the log report not showing the version of mods.",
          "Fixed the Skyve Mod not updating the folder settings file in case it was corrupted.",
          "Fixed the screenshots carousel not properly displaying wide images.",
          "Fixed assets not matching their thumbnails from the newer AIL versions.",
          "Updated Translations."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.12.6",
    "Date": "2024-11-18",
    "ChangeGroups": [
      {
        "Name": "Hotfix",
        "Changes": [
          "Fixed backups getting created without a valid backup folder."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.12.5",
    "Date": "2024-11-18",
    "ChangeGroups": [
      {
        "Name": "Changes",
        "Changes": [
          "Updated the Notifications widget in the dashboard. Notifications are now grouped by time period and show their time.",
          "Notifications can all be dismissed now so you don't have to see them again.",
          "Improved restrictions and interactions with the Install, Backup, and Data folder selections.",
          "Updated translations."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.12.4",
    "Date": "2024-11-16",
    "ChangeGroups": [
      {
        "Name": "Changes",
        "Changes": [
          "Added a restriction when changing content locations to prevent accidental loss of data."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.12.3",
    "Date": "2024-11-15",
    "ChangeGroups": [
      {
        "Name": "Changes",
        "Changes": [
          "Added an option to choose between backing up all your playsets or just your active playset.",
          "Added an automatic setup when selecting a backup location which should help with invalid folders, in some cases.",
          "Made the warning about 'Invalid Folder' when selecting a backup location by-passable.",
          "Updated translations."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.12.2",
    "Date": "2024-11-13",
    "ChangeGroups": [
      {
        "Name": "Changes",
        "Changes": [
          "Added support for Asset Icon Library thumbnails inside Skyve."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.12.1",
    "Date": "2024-11-13",
    "ChangeGroups": [
      {
        "Name": "Changes",
        "Changes": [
          "Changed the restriction on the backup folder location. Skyve now checks if the folder can be used, instead of just not allowing user folders.",
          "Improved the restore UI's performance and added a Clear button to deselect everything.",
          "Improved the options screen with an updated UI.",
          "Added an option to disable log cleanup on launch.",
          "Fixed some asset mods not showing up in the mod list."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.12.0",
    "Date": "2024-11-08",
    "Tagline": "Automatic Backups - Skyve Backup Center",
    "ChangeGroups": [
      {
        "Name": "New Backup Features",
        "Changes": [
          "Skyve can now backup your important game files so that you never have to worry about lost progress ever again.",
          "Skyve can automatically backup and manage your savegames, settings files, mod files, playsets, maps, and local mods.",
          "Configure the backup system to your needs, with customizable update times, triggers, and cleanup options.",
          "Easily and quickly restore any backup using the new Backup Center tab.",
          "Conveniently glance, search, and manage your backups in the backup history section, all inside the Backup Center."
        ]
      },
      {
        "Name": "Changes",
        "Changes": [
          "Skyve now automatically detects if you have any broken settings files and lets you know with a notification on your dashboard.\r\n- If you have your backup settings configured, Skyve will automatically try to find the right backup to restore for a one-click solution to settings files getting corrupted after a crash.",
          "Increased the limit on PDX Mods dashboard widgets and improved the design to fix text overlaps.",
          "Improved the folder and file selection dialogs.",
          "Various improvements to UI elements throughout the app.",
          "Adding custom tags will correctly pre-select the mod's existing tags."
        ]
      },
      {
        "Name": "Fixes",
        "Changes": [
          "Fixed mods showing as missing dependencies / required.",
          "Fixed mods not correctly showing as included in your playset in various places.",
          "Fixed changing mod versions and removing/adding mods to all playsets not working in some cases.",
          "Fixed creating, importing, and cloning playsets sometimes using an existing one instead of the newly created one."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.11.3",
    "Date": "2024-11-01",
    "ChangeGroups": [
      {
        "Name": "Changes",
        "Changes": [
          "Backend improvements to better handle consecutive actions related to PDX Mods.",
          "Added Safe-mode shortcut URL: https://skyve-mod.com/app/safemode",
          "Various fixes to subscribing and enabling mods and changing versions.",
          "Fixed not being able to export a Log Report."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.11.2.2",
    "Date": "2024-10-31",
    "ChangeGroups": [
      {
        "Name": "Hotfix",
        "Changes": [
          "Fixed mod info cache not updating properly."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.11.2.1",
    "Date": "2024-10-31",
    "ChangeGroups": [
      {
        "Name": "Hotfix",
        "Changes": [
          "Fixed being unable to create log reports."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.11.2",
    "Date": "2024-10-31",
    "Tagline": "Version and Cache changes",
    "ChangeGroups": [
      {
        "Name": "Changes",
        "Changes": [
          "Backend changes to versioning of mods.",
          "Fixed the mod info cache not loading properly.",
          "You might experience a some oddities at first while the cache info is getting recycled."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.11.1",
    "Date": "2024-10-29",
    "ChangeGroups": [
      {
        "Name": "Hotfix",
        "Changes": [
          "Fixed multiple mods from different playsets showing up as included and enabled at the same time.",
          "Fixed the compatibility report warning about duplicate mods showing up even if the mods are not included and enabled."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.11.0",
    "Date": "2024-10-27",
    "ChangeGroups": [
      {
        "Name": "Asset and Content Changes",
        "Changes": [
          "Added support for official assets.",
          "Skyve will show the full list of assets (prefabs) that are contained within a pack in the Assets view, and in the package's page.",
          "Maps and savegames have been removed from the package and asset lists."
        ]
      },
      {
        "Name": "Performance Improvements",
        "Changes": [
          "Improved folder cleanup.",
          "Improved the performance and search function of the logs list.",
          "Improved the loading speed of content list views.",
          "Improved performance in views with lots of images.",
          "Fixed stuttering in image-heavy views by moving image loading off the main thread.",
          "Fixed stuttering or freezing when the PDX Mods sync process finishes.",
          "Moved cached thumbnails folder to reduce the memory load on the game."
        ]
      },
      {
        "Name": "User Interface Enhancements",
        "Changes": [
          "Added the period search to the pdx mods tab.",
          "Improved the default thumbnails for content views.",
          "Added a PDX Mods Sync status widget to the dashboard.",
          "Added a popular weekly mods from PDX Mods widget to the dashboard.",
          "Added a missing notification when the paradox backend fails to load, as well as a one-click repair to fix the issue.",
          "Replaced the log level filter with a new slider to make it easier to filter logs."
        ]
      },
      {
        "Name": "Bug Fixes",
        "Changes": [
          "Fixed an issue where the file-drop in Help and Logs did not show all logs from a zip file.",
          "Fixed an issue where the background service sometimes locked a file and prevented Skyve from logging in."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.10.2.5",
    "Date": "2024-08-14",
    "ChangeGroups": [
      {
        "Name": "Changes",
        "Changes": [
          "Added more restrictions and safeguards when changing the content location for the game to prevent users losing their data.",
          "Added a visual window to let users know that the location change process is still ongoing.",
          "Improved folder cleanup."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.10.2.4",
    "Date": "2024-08-12",
    "ChangeGroups": [
      {
        "Name": "Changes",
        "Changes": [
          "Backend improvements to reduce repeated calls to the PDX servers."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.10.2.3",
    "Date": "2024-08-11",
    "ChangeGroups": [
      {
        "Name": "Changes",
        "Changes": [
          "Moved the data cleanup to the skyve-app launch instead of game launch."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.10.2.2",
    "Date": "2024-08-10",
    "ChangeGroups": [
      {
        "Name": "Changes",
        "Changes": [
          "Fixed mods that have not yet received updates after their initial release causing an infinite reload when having their page open.",
          "Enabled DEBUG logging during safe mode launch."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.10.2.1",
    "Date": "2024-08-10",
    "ChangeGroups": [
      {
        "Name": "Changes",
        "Changes": [
          "Fixed an issue with 'Safe Mode' not working."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.10.2",
    "Date": "2024-07-30",
    "ChangeGroups": [
      {
        "Name": "Changes",
        "Changes": [
          "Added a 'Safe Mode' launch option in the Utilities page.",
          "Fixed Dev Mode and UI Dev Mode being mixed up in the playset menu.",
          "Save-games and Maps are no longer included in log reports' playset info.",
          "Updated translations."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.10.1",
    "Date": "2024-07-08",
    "ChangeGroups": [
      {
        "Name": "Changes",
        "Changes": [
          "Added the .cid file automatically when uploading a save-game.",
          "Added a link button that can be sent to you using the review request replies.",
          "Fixed getting multiple notifications about new comments during a long session.",
          "Fixed getting a notification about new comments if it was 'you' that commented."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.10.0",
    "Date": "2024-07-07",
    "ChangeGroups": [
      {
        "Name": "Review Requests",
        "Changes": [
          "You can now attach a save-game directly in your review request to better help us track down an issue. *This is optional.",
          "If you have a pending review request, it will be shown while viewing a mod's compatibility information.",
          "Skyve managers can now contact you on Skyve about your review request, letting you know if anything changed or if more information is needed.",
          "You will now get a notification if anything new happens with your review request, or if the mod's compatibility data is changed."
        ]
      },
      {
        "Name": "Comments",
        "Changes": [
          "Added a 'New' tag on comments that you haven't read yet. *This is local only, Skyve does not know if you read the comments on the PDX Forumns.",
          "Creators that have comments on their mods will get a notification when there's new comments that they haven't read yet."
        ]
      },
      {
        "Name": "Other Changes",
        "Changes": [
          "Added a button in the dashboard's new and recently updated mods sections to quickly jump to the PDX Mods tab with the selected tags and sorting.",
          "Fixed thumbnails in the mod gallery and comments not working/showing correctly.",
          "Fixed clicking on the attachment in the comments section not opening the image."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.9.5.4",
    "Date": "2024-07-04",
    "ChangeGroups": [
      {
        "Name": "Fixes",
        "Changes": [
          "Crash fixes."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.9.5.3",
    "Date": "2024-07-03",
    "ChangeGroups": [
      {
        "Name": "Changes & Fixes",
        "Changes": [
          "Your last selected tags in the PDX Mods page are now remembered throughout your session.",
          "Added a 'Disable Burst Compilation' launch option to the advanced playset launch options.",
          "Fixed being able to import a playset by dropping a log report into the designated drop section."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.9.5.2",
    "Date": "2024-06-29",
    "ChangeGroups": [
      {
        "Name": "Fixes",
        "Changes": [
          "Fixed not being able to properly update Skyve using an install location other than the default one.",
          "Fixed the 'Unknown Publisher' popup when installing Skyve from the in-game button and in-app update button."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.9.5.1",
    "Date": "2024-06-28",
    "ChangeGroups": [
      {
        "Name": "Changes & Fixes",
        "Changes": [
          "Added a tag on comments that reflect the version number of the mod at the time of posting. The tag is shown in Green when the version is the latest one of the mod.",
          "Added a link to the forum page of the mod if available.",
          "Added Player-prev.log to the log report.",
          "Fixed a case where users could not install Skyve properly.",
          "Fixed a crash when jumping between tabs in the Mod Page.",
          "Fixed the Skyve background service not getting installed.",
          "Fixed compatibility info for 'Broken From Patch' not working as intended."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.9.5",
    "Date": "2024-06-04",
    "ChangeGroups": [
      {
        "Name": "New Additions",
        "Changes": [
          "Added a new section in the Utilities tab that shows mods with issues, for example 'Out of date' mods. This section comes with a one-click button to fix all issues instantly.",
          "Added 'Copy PDX Mods link as Markdown' to the copy section when right-clicking on a mod.",
          "Added a more specific error message when launching Skyve with an incomplete configuration, letting users know they need to launch the game to complete the setup.",
          "Added custom protocols that can be access to open pages in Skyve, as well as running specific actions using web URLs. For example:\r\n• skyve-mod.com/app/mods/75804\r\n• skyve-mod.com/app/logreport/save"
        ]
      },
      {
        "Name": "Changes & Fixes",
        "Changes": [
          "Improved the single instance system, where launching Skyve will show up the already-running instance if available.",
          "Log Report's Mod List now includes the mod's version.",
          "Skyve version is now always automatically set to the latest version to keep users up to date.",
          "Applied author colors to the dashboard mod sections.",
          "Fixed the mod version not correctly updating after changing it.",
          "Fixed compatibility report list showing mods that are not enabled.",
          "Fixed image cache clearing going to the recycle bin instead of permanently getting deleted."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.9.4",
    "Date": "2024-06-04",
    "Tagline": "Author & Account Update",
    "ChangeGroups": [
      {
        "Name": "User Changes",
        "Changes": [
          "Added an automatic, unique color for users and authors throughout the app.",
          "Added custom Avatars images for users and authors throughout the app.",
          "Updated the user page with the Bio & Links that users have set up on PDX Mods.",
          "Added a new setting in the Options to disable colored user names and avatars."
        ]
      },
      {
        "Name": "Comments",
        "Changes": [
          "Added a new 'Comments' section in the Mod Page.",
          "You can directly reply and comment on mods from Skyve.",
          "Use various formatting options with dedicated formatting buttons and shortcuts.",
          "Easily track a conversation with color-coded user avatars"
        ]
      },
      {
        "Name": "Other Changes",
        "Changes": [
          "You can now click the download notification to go to a mod's page. You can now also right-click to open up the right-click menu.",
          "Improved log list performance.",
          "Small UI performance improvements.",
          "Fixed list views sometimes getting cut off at the end."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.9.3.3",
    "Date": "2024-05-30",
    "ChangeGroups": [
      {
        "Name": "Scrolling Changes",
        "Changes": [
          "Updated the scrolling behavior of all 'large list' pages.",
          "Scrolling is now on a standard scroll value instead of being index-based. This makes scrolling less jumpy and won't leave the bottom of the list empty.",
          "Changed the scrolling behavior of the Log list to the new scrolling that's used by other large lists. This will help with performance and will allow you to scroll to the very end when there's a lot of items in the list.'",
          "Fixed items sometimes jumping while scrolling in grid view."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.9.3.2",
    "Date": "2024-05-29",
    "ChangeGroups": [
      {
        "Name": "Out of date Changes",
        "Changes": [
          "Mods in your current playset that do not match the latest version of the mod are now shown as 'Out of date' in the mod list, and on your dashboard.",
          "Added a dropdown in the mod page where you can select a specific mod version."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.9.3.1",
    "Date": "2024-05-28",
    "ChangeGroups": [
      {
        "Name": "Hotfix",
        "Changes": [
          "Fixed not being able to see more than 100 mods in your playset.",
          "Fixed mod links all showing as 'Website'.",
          "Fixed mods getting a 'Source code not available' warning before the mod's information had even loaded.",
          "Added new translations."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.9.3",
    "Date": "2024-05-27",
    "ChangeGroups": [
      {
        "Name": "Improvements & Fixes",
        "Changes": [
          "Added missing icons for new PDX Mods links.",
          "Added a cleanup process when launching the game through Skyve.",
          "Improved the change-log grouping.",
          "Fixed the enabled filter not working correctly.",
          "Fixed some users not being able to launch the installer.",
          "Fixed the update times not being in users' local time.",
          "Fixed 'Copy mod name' in the right-click menu not working."
        ]
      },
      {
        "Name": "Log Report Changes",
        "Changes": [
          "Log report files now all have a 'username filter' to hide the sender's windows username.",
          "Log report can now be imported to view the sender's active playset mods. This is done by drag-n-dropping the log report in the Playsets list page.",
          "Added a log filter to hide useless warnings in the log.",
          "Fixed not being able to import a log report in the Compatibility Report page if you do not have any issues listed."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.9.2.6",
    "Date": "2024-05-09",
    "ChangeGroups": [
      {
        "Name": "Hotfix",
        "Changes": [
          "Fixed an error in the compatibility report page.",
          "Fixed not being able to import playsets that include over 2GB of mods"
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.9.2.5",
    "Date": "2024-05-04",
    "ChangeGroups": [
      {
        "Name": "Changes",
        "Changes": [
          "Added an install button in the Options to allow re-installing or in case the button in the main menu is not showing up."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.9.2.4",
    "Date": "2024-04-25",
    "ChangeGroups": [
      {
        "Name": "Changes",
        "Changes": [
          "Fixed potential errors in the compatibility report.",
          "Fixed not being able to right-click in the assets view.",
          "The download notification now correctly goes away if a download fails.",
          "Mod descriptions now scale properly on 4K displays.",
          "Fixed the mods change-log tab showing 'All Versions' more than once."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.9.2.3",
    "Date": "2024-04-07",
    "ChangeGroups": [
      {
        "Name": "Changes",
        "Changes": [
          "Added a setup screen when first installing Skyve to let users change the install location.",
          "Load order is now handled automatically by Skyve."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.9.2.2",
    "Date": "2024-04-03",
    "ChangeGroups": [
      {
        "Name": "Changes",
        "Changes": [
          "Fixed a bug that kept refreshing information on the dashboard."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.9.2.1",
    "Date": "2024-04-03",
    "ChangeGroups": [
      {
        "Name": "Changes",
        "Changes": [
          "Fixes for non-english languages filtering by Tags in PDX Mods tab.",
          "PDX Mods tab auto-load will now start before reaching the bottom"
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.9.2",
    "Date": "2024-03-28",
    "ChangeGroups": [
      {
        "Name": "Changes",
        "Changes": [
          "Updated the PDX Mods browsing tab. Filters, sorting, responsiveness have been improved.",
          "Mods hidden because of your playset's usage are now shown as very dim in the mods list instead.",
          "Fixed the background service not updating mods.",
          "Fixed global tags not showing up correctly.",
          "Fixed tags filter not working.",
          "Fixed launch not working for Gamepass users."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.9.1",
    "Date": "2024-03-26",
    "ChangeGroups": [
      {
        "Name": "Changes",
        "Changes": [
          "Added tags to the PDX Mods showcase on the dashboard.",
          "Stopping the game from Skyve now closes it normally so settings are saved properly by the game.",
          "Launching the game with no active playset will show a prompt letting you know that no mods will be enabled.",
          "Launching the game before the synchronization process ends will show a prompt asking if you'd like to launch automatically when it's done.",
          "Fixed non-english languages showing the incorrect text if they haven't been translated."
        ]
      }
    ]
  },
  {
    "Stable": false,
    "Beta": true,
    "Version": "0.9.0",
    "Date": "2024-03-25",
    "Tagline": "Official PDX Mods Release",
    "ChangeGroups": [
    ]
  }
]